DoubleH-hash/ESP32-CAMERA-LORA/camera1-master/src/wakeup.cpp
#include <Arduino.h>
#include "freertos/freertos.h"
#include "freertos/task.h"
#include "freertos/queue.h"
#include "soc/soc_caps.h"
#include "driver/uart.h"
#include "wakeup.h"


esp_sleep_wakeup_cause_t print_wakeup_reason()
{
    esp_sleep_wakeup_cause_t wakeup_reason;

    wakeup_reason = esp_sleep_get_wakeup_cause();
    switch (wakeup_reason)
    {
    case ESP_SLEEP_WAKEUP_EXT0:
        Serial.println("Wakeup caused by external signal using RTC_IO\r\n");
        break;
    case ESP_SLEEP_WAKEUP_EXT1:
        Serial.println("Wakeup caused by external signal using RTC_CNTL\r\n");
        break;
    case ESP_SLEEP_WAKEUP_TIMER:
        Serial.println("Wakeup caused by timer\r\n");
        break;
    case ESP_SLEEP_WAKEUP_TOUCHPAD:
        Serial.println("Wakeup caused by touchpad\r\n");
        break;
    case ESP_SLEEP_WAKEUP_ULP:
        Serial.println("Wakeup caused by ULP program\r\n");
        break;
    default:
        Serial.printf("Wakeup was not caused by deep sleep: %d\r\n", wakeup_reason);
        break;
    }
    return wakeup_reason;
}

// 执行即进入休眠模式
void sleep_Start()
{
    esp_sleep_enable_ext0_wakeup(GPIO_PIN_Wakeup, 1); // 1 = High, 0 = Low
    Serial.println("Going to sleep now");
    esp_deep_sleep_start();
}

